In [34]:
import numpy as np
import pandas as pd
s = pd.Series(np.random.randn(10), 
              index=[['a','a','a','b','b','b','c','c','d','d'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
s

a  1   -1.943674
   2    0.401999
   3   -1.395870
b  1   -1.356798
   2    0.482499
   3    1.877987
c  1    0.332431
   2   -1.725666
d  2    0.471544
   3    1.027369
dtype: float64

In [35]:
s.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [5]:
# 가장 바깥쪽 인덱스부터 인덱싱하는 것이 원칙
s['b']

1   -1.299834
2    0.118019
3   -1.964536
dtype: float64

In [7]:
s['b':'c']

b  1   -1.299834
   2    0.118019
   3   -1.964536
c  1    0.081587
   2   -0.306019
dtype: float64

In [8]:
# 인덱스[상위계층, 하위계층]
s['b',3]  # 계층적인 인덱싱일때

-1.9645361585392536

In [9]:
# .loc[행, 열]  # 행과 열로 표현하고싶을땐 loc 써야함
s[:, 2]

a    1.095575
b    0.118019
c   -0.306019
d   -0.344734
dtype: float64

In [11]:
df = pd.DataFrame(np.arange(12).reshape((4,3)),
                 index=[['a','a','b','b'],[1, 2, 1, 2]],
                 columns=[['Seoul','Seoul','Busan'],['Green','Red','Green']])
df

    Seoul     Busan
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [13]:
df.index.names = ['key1','key2']
df.columns.names = ['city','color']
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [14]:
df['Seoul']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [15]:
df['Seoul', 'Green']

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Seoul, Green), dtype: int32

In [16]:
df.loc['a']

city  Seoul     Busan
color Green Red Green
key2
1         0   1     2
2         3   4     5

In [17]:
df.loc['a', 1]

city   color
Seoul  Green    0
       Red      1
Busan  Green    2
Name: (a, 1), dtype: int32

In [18]:
df.loc['b', ('Seoul', 'Red')]

key2
1     7
2    10
Name: (Seoul, Red), dtype: int32

In [20]:
df.loc[('b', 2), 'Busan']

color
Green    11
Name: (b, 2), dtype: int32

In [21]:
df.loc[('b', 1), ('Seoul', 'Green')]

6

In [22]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [23]:
# 정렬 : sort_index(axis=0, level=1)
df.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [24]:
df.sort_index(axis=0, level=1)  # axis=0 행 방향, level=1 두번째 키값을 기준으로 인덱싱

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [25]:
df.sort_index(axis=0, level='key2')

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [26]:
df.sort_index(axis=1, level=0)

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [27]:
# sort_values(by='컬럼명')
df.sort_values(by=('Busan','Green'))    # by =(상위계층,하위계층) / 부산-그린계층으로 정렬

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [37]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [36]:
# 각 열에 대한 합을 계산하시오.
df.sum(axis=0)

city   color
Seoul  Green    18
       Red      22
Busan  Green    26
dtype: int64

In [40]:
# axis=0  열에 따라 행 방향으로(index),
# axis=1  행에 따라 열 방향으로(columns)

# level = 0  첫번째 index층을 기준으로,  a,b를 구분하여 합이 구해진다.
df.sum(axis=0, level=0)

city  Seoul     Busan
color Green Red Green
key1
a         3   5     7
b        15  17    19

In [43]:
df.sum(axis=0, level=1)  # 두번째 index에서 같은거끼리 합침 / 첫번째 index는 사라짐..

city  Seoul     Busan
color Green Red Green
key2
1         6   8    10
2        12  14    16

In [44]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [46]:
df.mean(axis=1, level='color')

color      Green  Red
key1 key2
a    1         1    1
     2         4    4
b    1         7    7
     2        10   10

In [47]:
df2 = pd.DataFrame({'a':range(7), 'b':range(7,0,-1),
                   'c':['one','one','one','two','two','two','two'],
                   'd':[0,1,2,0,1,2,3]})
df2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [48]:
df2.index

RangeIndex(start=0, stop=7, step=1)

In [50]:
# 공통된 값을 가진 데이터를 계층적인덱스로 바꿀 수 있음,, (c, d열)
# c열과 d열을 계층적 인덱스로 변경
# set_index() : 리스트 형식으로, 계층순서대로 컬럼명을 주면 컬럼에 따라 인덱스가 바뀜
df3 = df2.set_index(['c','d'])  # c,d열이 인덱스로 가고, 데이터는 사라짐
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [51]:
df2.set_index(['c','d'], drop=False)  # c,d열이 인덱스로 가지만, 데이터는 남아있음

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [53]:
# 인덱스 취소하기 ... 순서는 바뀜
df3.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

### DataFrame 인덱스와 컬럼전환

In [56]:
df4 = pd.DataFrame(np.arange(6).reshape((2,3)),
                  index=['Seoul','Busan'],
                  columns=['one','two','three'])
df4

       one  two  three
Seoul    0    1      2
Busan    3    4      5

In [57]:
df4.index.name = 'city'   # names-> 인덱스 여러개일 때
df4.columns.name = 'number'
df4

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [60]:
df5 = df4.stack()  # 시리즈형태로 바뀜,, + 계층적 인덱스
df5

city   number
Seoul  one       0
       two       1
       three     2
Busan  one       3
       two       4
       three     5
dtype: int32

In [61]:
df5.unstack()  # df5.unstack().unstack().unstack().unstack().unstack()

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

### 병합
- merge : 공통된 하나의 열(또는 행)을 기준으로 합친다.  n x m (join과 유사)
- concat : 이어붙이기, 동일한 index나 columns를 가지고 있는 경우

In [66]:
df1 = pd.DataFrame({'key':list('bbacaab'), 'data1':range(7)})
df2 = pd.DataFrame({'key':list('abd'), 'data2':range(3)})

In [67]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [68]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [70]:
#pd.merge(df1, df2)
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [73]:
# 양 쪽에 존재하는 모든 조합 (how='outer')
pd.merge(df1, df2, on='key', how='outer')  # c,d가 생기면서, 빈 자리가 결측처리됨(NaN)

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [74]:
# 왼쪽에 있는 행은 고정. / df1의 key값 // (오른쪽(df2)은 없으면 제거됨..)
pd.merge(df1, df2, on='key', how='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

In [75]:
pd.merge(df1, df2, on='key', how='right') # df2의 key값

  key  data1  data2
0   b    0.0      1
1   b    1.0      1
2   b    6.0      1
3   a    2.0      0
4   a    4.0      0
5   a    5.0      0
6   d    NaN      2

In [77]:
df3 = pd.DataFrame({'key':list('bbacaab'), 'data1':range(7)})
df4 = pd.DataFrame({'key':list('ababd'), 'data2':range(5)})

In [78]:
df3

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [79]:
df4

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [80]:
# how 인자에 innner를 넣으면, 넣지않은 것과 동일하나,
# 공통된 값이 없으면 생략된다.
#pd.merge(df3, df4, on='key')
pd.merge(df3, df4, on='key', how='inner')

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    b      6      1
5    b      6      3
6    a      2      0
7    a      2      2
8    a      4      0
9    a      4      2
10   a      5      0
11   a      5      2

In [81]:
# 합치고자 하는 컬럼이 동일한 값이 존재하지 않으면 합칠때 명시해준다.
df5 = pd.DataFrame({'lkey':list('bbacaab'), 'data1':range(7)})
df6 = pd.DataFrame({'rkey':list('abd'), 'data1':range(3)})

In [82]:
df5

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [83]:
df6

  rkey  data1
0    a      0
1    b      1
2    d      2

In [84]:
pd.merge(df5, df6, left_on='lkey', right_on='rkey')

  lkey  data1_x rkey  data1_y
0    b        0    b        1
1    b        1    b        1
2    b        6    b        1
3    a        2    a        0
4    a        4    a        0
5    a        5    a        0

In [86]:
left1 = pd.DataFrame({'lkey':list('abaabc'), 'data1':range(6)})
right1 = pd.DataFrame({'group_val':[3.5, 7]}, index=['a', 'b'])

In [87]:
left1

  lkey  data1
0    a      0
1    b      1
2    a      2
3    a      3
4    b      4
5    c      5

In [88]:
right1

   group_val
a        3.5
b        7.0

In [92]:
pd.merge(left1, right1, left_on='lkey', right_index=True)

  lkey  data1  group_val
0    a      0        3.5
2    a      2        3.5
3    a      3        3.5
1    b      1        7.0
4    b      4        7.0

In [93]:
left2 = pd.DataFrame([[1,2],[3,4],[5,6]],
                    index=['a','c','e'],
                    columns=['Seoul', 'Incheon'])
right2 = pd.DataFrame([[7,8],[9,10],[11,12],[13,14]],
                     index=['b','c','d','e'],
                     columns=['Daegu','Ulsan'])

In [94]:
left2

   Seoul  Incheon
a      1        2
c      3        4
e      5        6

In [95]:
right2

   Daegu  Ulsan
b      7      8
c      9     10
d     11     12
e     13     14

In [96]:
pd.merge(left2, right2, left_index=True, right_index=True, how='outer')

   Seoul  Incheon  Daegu  Ulsan
a    1.0      2.0    NaN    NaN
b    NaN      NaN    7.0    8.0
c    3.0      4.0    9.0   10.0
d    NaN      NaN   11.0   12.0
e    5.0      6.0   13.0   14.0

In [97]:
s1 = pd.Series([0, 1], index=['a','b'])
s2 = pd.Series([2,3,4], index=['c','d','e'])
s3 = pd.Series([5, 6], index=['f','g'])

In [98]:
s1

a    0
b    1
dtype: int64

In [99]:
s2

c    2
d    3
e    4
dtype: int64

In [100]:
s3

f    5
g    6
dtype: int64

In [101]:
# concat() : 리스트 형식으로 들어온 객체를 단순히 연결하는 함수  # 이어붙이려는 개체는 리스트형태여야함
# axis=0  행 , 생략가능
# axis=1 열
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [102]:
pd.concat([s1, s2, s3], axis=1)

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0